In [1]:
import pandas as pd
import os
from datetime import datetime as dt

In [2]:
df_22 = pd.read_excel('2022 Ercot.xlsx')
df_22.tail(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
4340,06/30/2022 22:00,14543.743791,2317.353423,5021.561581,1508.412332,21016.916699,5195.665749,11277.425213,1676.344944,62557.423731
4341,06/30/2022 23:00,14065.386852,2139.177590,4927.674302,1402.099350,19729.504600,4975.040599,10505.303075,1570.206421,59314.392788
4342,06/30/2022 24:00,13484.378935,1968.957888,4853.353997,1301.524698,18321.175210,4614.967884,9591.968920,1458.991228,55595.318760

In [3]:
df_22.shape

(4343, 10)

In [4]:
df_21 = pd.read_excel('2021 Ercot.xlsx')
df_21.tail(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
8757,12/31/2021 22:00,13116.012129,1515.852644,4148.330779,859.408149,10978.547227,3515.077507,6800.707246,1071.686005,42005.621687
8758,12/31/2021 23:00,12754.392799,1457.080439,4161.355505,831.148872,10578.729201,3368.125857,6497.990404,1049.414195,40698.237272
8759,12/31/2021 24:00,12386.413060,1415.239264,4119.738722,807.084492,10140.379573,3234.113244,6151.440423,1016.183096,39270.591873

In [5]:
df_21.shape

(8760, 10)

In [6]:
df_20 = pd.read_excel('2020 Ercot.xlsx')
df_20.tail(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
8781,12/31/2020 22:00,11560.408167,1680.800823,3925.708218,928.517370,15179.536570,3571.725609,8334.601541,1573.542580,46754.840878
8782,12/31/2020 23:00,11339.877692,1627.080961,3895.376959,891.856675,14650.060694,3524.972799,8024.802495,1521.383987,45475.412261
8783,12/31/2020 24:00,11168.525005,1587.730775,3871.535088,861.787382,14198.042157,3503.378353,7826.044794,1486.503788,44503.547341

In [7]:
df_20.shape

(8784, 10)

In [8]:
df_19 = pd.read_excel('2019 Ercot.xlsx')
df_19.tail(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
8757,12/31/2019 22:00,10592.539874,1403.990584,3639.463899,819.394012,12716.274141,2930.563230,5968.287603,1260.087906,39330.601248
8758,12/31/2019 23:00,10304.624870,1387.051521,3630.184859,804.714775,12413.090126,2829.531899,5769.745220,1238.412254,38377.355525
8759,12/31/2019 24:00,10019.771129,1357.841863,3628.068853,790.865357,12084.775970,2747.692143,5614.231555,1217.592105,37460.838975

In [9]:
df_19.shape

(8760, 10)

In [10]:
df_18 = pd.read_excel('2018 Ercot.xlsx')
df_18.tail(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
8757,12/31/2018 22:00,10389.919171,1317.875105,3112.196787,840.751157,12238.695990,3135.496237,6252.541918,1248.207087,38535.683453
8758,12/31/2018 23:00,10179.719448,1285.166362,3110.924014,836.086501,11964.726843,3092.306962,6127.855412,1254.527211,37851.312753
8759,12/31/2018 24:00,10008.271141,1271.837587,3120.418939,826.962308,11775.973366,3071.164955,6035.861773,1260.779203,37371.269273

In [11]:
df_18.shape

(8760, 10)

In [12]:
df_17 = pd.read_excel('2017 Ercot.xlsx')
df_17.tail(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
8757,12/31/2017 22:00,11754.250889,1890.359350,2942.227121,1178.171245,19726.459865,3690.567365,9402.193277,1767.742081,52351.971192
8758,12/31/2017 23:00,11579.853459,1855.937814,2898.567893,1157.488537,19211.158684,3689.751261,9260.416988,1735.764393,51388.939028
8759,12/31/2017 24:00,11452.163689,1834.871741,2856.941683,1145.645045,18944.980941,3726.039934,9172.714892,1701.543039,50834.900964

In [13]:
df_17.shape

(8760, 10)

In [14]:
df_16 = pd.read_excel('2016 Ercot.xlsx')
df_16.tail(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
8781,2016-12-31 22:00:00.003,9668.239226,1106.560529,2045.303156,713.668403,10200.589061,2655.172757,5172.592743,975.840716,32537.966593
8782,2016-12-31 22:59:59.997,9332.315239,1076.492598,2018.220017,704.164722,9846.657014,2534.890339,4930.975674,950.065468,31393.781071
8783,2017-01-01 00:00:00.000,9029.597200,1029.875730,1991.563500,689.630460,9543.490800,2427.623800,4707.750510,932.266730,30351.798730

In [15]:
df_16.shape

(8784, 10)

In [16]:
df_15 = pd.read_excel('2015 Ercot.xls')
df_15.tail(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
8757,2015-12-31 22:00:00.003,9836.114934,1330.866082,2154.405686,840.608568,12578.409749,3054.399972,5919.270362,1215.899839,36929.975190
8758,2015-12-31 22:59:59.997,9533.866160,1301.045868,2134.855524,818.198219,12135.220068,2946.803689,5605.828903,1184.392095,35660.210526
8759,2016-01-01 00:00:00.000,9300.245000,1267.262520,2134.056300,812.456770,11782.715000,2870.463200,5346.676040,1163.503450,34677.378280

In [17]:
df_15.shape

(8760, 10)

In [18]:
df_14 = pd.read_excel('2014 Ercot.xls')
df_14.tail(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
8757,2014-12-31 22:00:00.003,10922.048671,1501.159511,2206.712077,983.763871,15247.666856,3854.155416,7482.140823,1603.147327,43800.794552
8758,2014-12-31 22:59:59.997,10520.761596,1437.414501,2156.489005,945.929920,14547.834047,3731.051912,7164.857637,1550.957310,42055.295929
8759,2015-01-01 00:00:00.000,10156.086100,1389.019650,2117.036400,918.525200,14045.144600,3661.591600,6915.819180,1504.437620,40707.660350

In [19]:
df_14.shape

(8760, 10)

In [20]:
df_13 = pd.read_excel('2013 Ercot.xls')
df_13.tail(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
8757,2013-12-31 22:00:00.003,10146.767461,1424.347535,1862.118638,840.019363,13113.728670,3597.222892,6589.516437,1147.052275,38720.773270
8758,2013-12-31 22:59:59.997,9740.175233,1388.813409,1846.269656,819.977135,12784.725967,3447.566135,6399.695034,1128.938267,37556.160835
8759,2014-01-01 00:00:00.000,9412.826300,1366.733450,1830.719100,802.318910,12516.250400,3340.239500,6240.917540,1117.115920,36627.121120

In [21]:
df_13.shape

(8760, 10)

In [22]:
df_12 = pd.read_excel('2012 Ercot.xls')
df_12.tail(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
8781,2012-12-31 22:00:00.003,8527.194858,1140.036890,1475.875350,821.077843,11718.377883,2609.661205,5103.819112,966.436026,32362.479166
8782,2012-12-31 22:59:59.997,8185.989966,1121.583439,1456.711482,798.205052,11150.109647,2459.220415,4841.914447,937.489827,30951.224275
8783,2013-01-01 00:00:00.000,7893.398200,1088.466640,1439.204660,778.922080,10730.757800,2315.334400,4591.715770,909.939940,29747.739490

In [23]:
df_12.shape

(8784, 10)

In [24]:
df_11 = pd.read_excel('2011 Ercot.xls')
df_11.tail(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
8757,2011-12-31 22:00:00.003,8692.533931,1027.242321,1306.902837,683.808364,9662.494605,2455.504473,4738.330423,887.467104,29454.284058
8758,2011-12-31 22:59:59.997,8327.877220,981.143365,1288.883581,668.308149,9279.883957,2343.906151,4529.861923,872.751047,28292.615393
8759,2012-01-01 00:00:00.000,8013.891300,928.241580,1286.278970,648.712210,8921.092600,2210.533700,4337.333430,857.648870,27203.732660

In [25]:
df_11.shape

(8760, 10)

In [26]:
df_10 = pd.read_excel('2010 Ercot.xls')
df_10.tail(3)

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
8757,2010-12-31 22:00:00.003,8591.386958,1002.451993,1340.629911,747.974811,10663.028285,2408.204530,4902.355953,961.752932,30617.785373
8758,2010-12-31 22:59:59.997,8076.188036,955.719765,1307.676088,726.621714,10301.263076,2291.589174,4738.594513,953.731285,29351.383650
8759,2011-01-01 00:00:00.000,7767.217400,916.000730,1296.824070,722.303010,10105.770300,2148.656300,4597.810650,941.806390,28496.388850

In [27]:
df_10.shape

(8760, 10)

In [28]:
# df_9 = pd.read_excel('2009 Ercot.xls')
# df_9.head(3)

In [29]:
# df_9.shape

In [30]:
# df_8 = pd.read_excel('2008 Ercot.xls')
# df_8.head(3)

In [31]:
# df_8.shape

In [32]:
# df_7 = pd.read_excel('2007 Ercot.xls')
# df_7.head(3)

In [33]:
# df_7.shape

In [34]:
# df_6 = pd.read_excel('2006 Ercot.xls')
# df_6.head(3)

In [35]:
# df_6.shape

In [36]:
# df_5 = pd.read_excel('2005 Ercot.xls')
# df_5.head(3)

In [37]:
# df_5.shape

In [38]:
# df_4 = pd.read_excel('2004 Ercot.xls')
# df_4.head(3)

In [39]:
# df_4.shape

In [40]:
# df_3 = pd.read_excel('2003 Ercot.xls')
# df_3.head(3)

In [41]:
# df_3.shape

In [42]:
total_df = pd.concat([df_10, df_11, df_12, df_13, df_14, df_15, df_16, df_17, df_18, df_19, df_20, df_21, df_22])

In [43]:
total_df.head()

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
0,2010-01-01 01:00:00.003000,7775.456846,1238.179861,1237.649967,877.672404,12405.849409,2467.581039,5031.931981,1059.742927,32094.064435
1,2010-01-01 01:59:59.997000,7704.815982,1236.050964,1248.907364,883.621724,12485.814858,2436.025369,5111.468920,1064.617365,32171.322546
2,2010-01-01 03:00:00,7650.575724,1244.073140,1251.207485,881.155327,12559.461123,2414.440222,5168.887617,1071.951825,32241.752463
3,2010-01-01 04:00:00.003000,7666.708317,1253.211110,1260.419002,894.330100,12671.847950,2383.948564,5241.889124,1086.839061,32459.193227
4,2010-01-01 04:59:59.997000,7744.960869,1284.055257,1264.653516,906.325283,12912.267303,2498.179406,5401.453950,1111.855463,33123.751047

In [44]:
total_df.tail()

,Hour Ending,COAST,EAST,FWEST,NORTH,NCENT,SOUTH,SCENT,WEST,ERCOT
4338,06/30/2022 20:00,14700.132848,2508.717077,5099.466893,1663.609500,22836.862003,5558.048575,12248.057323,1814.172453,66429.066672
4339,06/30/2022 21:00,14637.633680,2390.824977,5032.712777,1577.234645,21780.555059,5390.475137,11710.465084,1733.335687,64253.237046
4340,06/30/2022 22:00,14543.743791,2317.353423,5021.561581,1508.412332,21016.916699,5195.665749,11277.425213,1676.344944,62557.423731
4341,06/30/2022 23:00,14065.386852,2139.177590,4927.674302,1402.099350,19729.504600,4975.040599,10505.303075,1570.206421,59314.392788
4342,06/30/2022 24:00,13484.378935,1968.957888,4853.353997,1301.524698,18321.175210,4614.967884,9591.968920,1458.991228,55595.318760

In [45]:
total_df.shape

(109535, 10)

In [47]:
coast_df = total_df.drop(columns = ['EAST', 'FWEST', 'NORTH', 'NCENT', 'SOUTH', 'SCENT', 'WEST', 'ERCOT'])
coast_df.head()

                  Hour Ending        COAST
0  2010-01-01 01:00:00.003000  7775.456846
1  2010-01-01 01:59:59.997000  7704.815982
2         2010-01-01 03:00:00  7650.575724
3  2010-01-01 04:00:00.003000  7666.708317
4  2010-01-01 04:59:59.997000  7744.960869

In [48]:
coast_df.shape

(109535, 2)

In [49]:
coast_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 109535 entries, 0 to 4342
Data columns (total 2 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Hour Ending  109535 non-null  object
 1   COAST        109534 non-null  float64
dtypes: float64(1), object(1)
memory usage: 2.5+ MB

In [50]:
coast_df.rename(columns={"Hour Ending": "datetime", "COAST": "ercot_load"}, inplace=True)

In [51]:
coast_df.to_csv('coast_df.csv')

In [52]:
total_df.to_csv('total_df.csv')

In [53]:
# pd.to_datetime(coast_df.datetime)

In [54]:
# coast_df.set_index('datetime')

In [55]:
# coast_df.info()